{
  "name": "Andrew Anthony Gerst",
  "title": "Senior Software Engineer (Full-Stack)",
  "number": "[url=tel:+17047408492]704-740-8492[/url]",
  "email": "[url=mailto:gerst20051@gmail.com]gerst20051@gmail.com[/url]",
  "url": [
    "[url]https://github.com/Gerst20051[/url]",
    "[url]https://linkedin.com/in/andrewgerst[/url]"
  ],
  "statement": [
    "I promise to whoever saves me from being homeless that you won't regret giving me a chance!",
    "I was Passport's 12th employee (5th engineer) and we grew to 300+ and acquired 3 companies!",
    "I was the 5th member of Checkr's International team and helped our team scale to 30 strong!"
  ],
  "skills": [
    {
        "name": "Main",
        "show": true,
        "list": [
            "Ruby",
            "Node",
            "JavaScript",
            "TypeScript",
            "React",
            "Python",
            "PHP",
            "Go",
            "MySQL",
            "Postgres",
            "Mongo",
            "Redis",
            "AWS",
            "Swift"
        ]
    }
  ],
  "experience": [
    {
      "title": "Senior Software Engineer",
      "organization": "[url=https://www.checkr.com]Checkr[/url] | Background Check Platform",
      "startDate": "February 2021",
      "endDate": "April 2024",
      "highlights": {
        "Major Product Enhancements": [
          "Created a Ruby on Rails platform that dramatically reduced the complexity of building new screenings",
          "Led the implementation of Amplitude analytics that significantly improved our product insights",
          "Led the creation of multiple new screenings that expanded our product capabilities",
          "Reduced developer frustration and technical debt by unifying multiple divergent products",
          "Improved candidate experience by removing the need to print and fill out PDF documents",
          "Improved screening TAT by creating jobs that monitored and resolved stuck workflows",
          "Created Datadog monitors and Snowflake dashboards to improve observability",
          "Mentored our summer interns and helped lead their project to completion"
        ],
        "Improved Developer Productivity (Above & Beyond My Role Responsibilities)": [
          "Reduced the time 50+ engineers spent onboarding from weeks down to hours",
          "Created scripts to set up and run multiple services in local dev environment",
          "Ensured a smooth transition from Intel to ARM based MacBook architecture",
          "Created scripts automating workflows that required manual interactions",
          "Created scripts to ease the administration of our Kubernetes clusters",
          "Created Ruby Thor scripts that automated various on-call support tasks"
        ]
      }
    },
    {
      "title": "Senior Software Engineer",
      "organization": "[url=https://www.brainbase.com]Brainbase[/url] | Intellectual Property Platform",
      "startDate": "May 2020",
      "endDate": "September 2020",
      "responsibilities": "Created a docker environment for local development and fixed various frontend and backend bugs"
    },
    {
      "title": "Senior Software Engineer",
      "organization": "[url=https://www.passportinc.com]Passport[/url] | Mobility Software Platform",
      "startDate": "December 2013",
      "endDate": "April 2020",
      "highlights": {
        "Modernized & Scaled Architecture": [
          "Led the creation of a platform enabling integrations with our public API",
          "Migrated our legacy PHP monolith to microservices using AWS Lambda and Node/TypeScript",
          "Migrated our web apps to React and our iOS apps to Swift",
          "Migrated our databases from MySQL to DynamoDB"
        ],
        "Promoted A High-Performance Culture": [
          "Interviewed candidates for roles up to VP of Engineering",
          "Streamlined our onboarding process via documentation and automation",
          "Mentored peers and was a highly available, trusted source for advice",
          "Created many tools enabling new ways for engineers to work more efficiently"
        ],
        "Core Business Expertise": [
          "Lead maintainer of our Python rate engine, a critical component for facilitating payments",
          "Built custom mobile and web apps for 20+ of our high-volume clients in a scalable way",
          "Implemented third-party integrations to satisfy RFP requirements to win new clients",
          "Added i18n support in our apps so that we could expand to markets internationally",
          "Built integrations with our in-house PCI-compliant payment gateway service"
        ]
      }
    },
    {
      "title": "Computer Programmer",
      "organization": "[url=https://cs.unc.edu]UNC Chapel Hill Computer Science Department[/url]",
      "startDate": "November 2011",
      "endDate": "June 2012",
      "responsibilities": "I built a YouTube app for people with disabilities who access their computers via 2 switches."
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Science (B.S.) Computer Science",
      "university": "University of North Carolina at Chapel Hill",
      "startYear": 2011,
      "endYear": 2013,
      "achievements": "I placed in multiple programming competitions and hackathons both individually and with teammates."
    }
  ],
  "projects": [
    {
      "name": "My Games",
      "url": "[url]http://games.hnswave.co[/url]",
      "desc": "I enjoy building browser-based games in my free time using a game engine I wrote from scratch."
    }
  ]
}
