{
  "name": "Andrew Anthony Gerst",
  "title": "Software Engineer",
  "number": "[url=tel:+17047408492]704-740-8492[/url]",
  "email": "[url=mailto:gerst20051@gmail.com]gerst20051@gmail.com[/url]",
  "statement": "I’m looking for something exceptional! I am a software engineer currently living in Charlotte, NC. I've been working at Passport starting as the 12th employee back in 2013. It's been an exhilarating journey since we've been growing exponentially! I have a vast array of experience and can tackle anything that comes my way. I still love working at Passport but I'm looking to see if there are any very attractive opportunities in Los Angeles since I’m considering moving to the area. Let’s discuss what you are looking for to see if I would be an excellent fit. I'd love to hear more about the current challenges you are facing and learn more about the team culture. I wanted to keep this resume simple so feel free to reach out if you have any questions for me! I look forward to talking!",
  "skills": [
    "adt",
    "android",
    "ansible",
    "arduino",
    "asana",
    "auth0",
    "aws",
    "bash",
    "ble",
    "bower",
    "browser-sync",
    "browserify",
    "c",
    "casperjs",
    "chai",
    "ci/cd",
    "cloudwatch",
    "coffee-script",
    "coffeeify",
    "css",
    "debowerify",
    "dojo",
    "dynamodb",
    "express",
    "fogbugz",
    "git",
    "gitlab",
    "graphviz",
    "gulp",
    "gwt",
    "html5",
    "jade",
    "java",
    "javascript",
    "jest",
    "jira",
    "jquery",
    "jscs",
    "jshint",
    "kotlin",
    "lambda",
    "less",
    "make",
    "matlab",
    "microservices",
    "migrations",
    "mips",
    "mocha",
    "mysql",
    "nfc",
    "nightmarejs",
    "node",
    "npm",
    "nvm",
    "oauth",
    "phantomjs",
    "phpcs",
    "pug",
    "python",
    "qrcode",
    "rally",
    "raspberry pi",
    "react",
    "redbean",
    "redis",
    "redmine",
    "ruby",
    "sass/scss",
    "serverless",
    "socket.io",
    "stylus",
    "swift",
    "testflight",
    "titanium",
    "ubuntu",
    "unix",
    "vagrant",
    "vi/vim",
    "web-workers",
    "websockets",
    "workerify",
    "wrk",
    "wsdl",
    "xcode",
    "yamilify",
    "yaml",
    "youtube-api",
    "zsh"
  ],
  "experience": [
    {
      "title": "Software Engineer",
      "organization": "[url=https://www.passportinc.com/]Passport[/url] | Mobility Software Platform",
      "startDate": "December 2013",
      "endDate": "Present",
      "responsibilities": "(I Need To Update This) All around navy seal that puts out fires. Contributed to every platform in our system from server-side programming using php / python to client side programming of our web, android, and ios apps (originally titanium and then I cloned our app to swift when that was released) to creating the vagrant/ansible development environments that all the developers use today which also contributed and was the main driving force toward out transition to building our production environment from scratch in code and ultimately a very fast-paced environment with continuous deployments using gitlab, merge requests, and gitlab ci. I have developed a majority of our whitelabel apps on all of our platforms for our biggest clients such as [url=http://chicagoparking.ppprk.com/apps/v7/mobilepayweb]ParkChicago[/url], [url=http://parkgreenp.ppprk.com/apps/v7/mobilepayweb]ParkGreenP[/url] (largest mobile payment platform in north america), and [url=http://gotucsonapp.ppprk.com/apps/v7/mobilepayweb]GoTucson[/url] (first all city app for parking & transit). Coordinated round the clock projects with multiple team members that are located in 3 continents including Barcelona, Spain and Bangalore, India. I took the initiative to document all of our systems and processes to help make the onboarding of all future developers seamless. I also created many of our internal shell scripts and tools that our devs use everyday such as the log reader to debug server logs. I've also created a Makefile that will setup a complete dev environment in one command. Maintained and improved our rate engine which remains to be the most versatile, reliable, and flexible rate engine in the industry. Without a reliable rate engine it's unlikely that Passport would exist today. I've also helped develop our ticket reader for transit ticket validation using BLE (Bluetooth Low Energy), NFC, and QR Codes."
    },
    {
      "title": "Computer Programmer",
      "organization": "UNC Chapel Hill Computer Science Department",
      "startDate": "November 2011",
      "endDate": "June 2012",
      "responsibilities": "Accessible YouTube is an interface to YouTube designed for people who access their computers via either 2 switches for children with disabilities or a mouse."
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Arts (B.A.) Computer Science",
      "university": "University of North Carolina at Chapel Hill",
      "startYear": 2011,
      "endYear": 2013,
      "achievements": "Won second place in a programming competition hosted by the founders of Passport Parking. I was a first year undergraduate student competing against mostly graduate students. My team and I placed third out of eight teams in Facebook's 2012 North Carolina Hackathon hosted at Duke University."
    }
  ],
  "projects": [
    {
      "name": "Log Reader",
      "url": "[url]https://github.com/Gerst20051/log-reader[/url]",
      "desc": "Tool for streaming server logs to the browser for filtering, highlighting, excluding, color-coding, and adding syntax highlighting to json objects and mysql queries."
    }
  ]
}
