{
    "name": "Mary Sue Posluszny",
    "title": "DMV Examiner",
    "location": "Vale, NC, United States",
    "number": "7045760885",
    "email": "[url=mailto:mflyer1049@live.com]mflyer1049@live.com[/url]",
    "dateOfBirth": "October 31, 1949",
    "certifications": [
        "CDL with all endorsements",
        "Post Crash",
        "Accident Causation",
        "Emissions",
        "Federal and Comar Regulations",
        "Commercial Vehicle Inspector",
        "Vehicle Safety Inspector",
        "Salvage Inspection",
        "Instructor for trainees",
        "Driver License Examiner"
    ],
    "experience": [
        {
            "title": "Driver License Senior Examiner",
            "organization": "State of NC - DOT-DMV, Newton Office",
            "startDate": "Jul 2011",
            "endDate": "Last Day [Mar 29, 2019] Retirement Date [Apr 1, 2019]",
            "info": {
                "address": "1033 Smyre Farm Rd, Newton, NC 28658",
                "supervisor": "Sandy Horton [Western District Manager] - Phyllis Young [Charlotte District Manager]",
                "numberSupervised": 6,
                "reasonForLeaving": "Retired"
            },
            "technologies": [
                "[b]management[/b]",
                "[b]supervisory[/b]",
                "driver education program specialist"
            ],
            "responsibilities": "Exercise judgment and discretion while working independently. Listen, understand and explain and communicate effectively with all customers, parents, children, court system personnel, Raleigh DMV and any other persons who have an interest. Test customers for purposes of medical conditions to make sure they are medically and physically capable of safely operating a motor vehicle on the public highway and promote highway safety. Deal with complex situations that include such things as very sensitive medical problems and age related conditions that would prevent customers from safely driving. Also work with families in areas of conditions that would prevent customers from driving and those who do not qualify, explaining the situation and reasons in order to help them with the transition from driving to no longer having a license. Handle complex problems using the Examiner Manual, NCGS Chapter 20 and other available sources obtained from the NC Justice Academy. Handle PC computers, Viisage Digital Imaging System, multiple line telephone system, Nemo-Q, printers, scanners, etc. Evaluate authenticity of foreign and domestic documents for cases of fraud and identity theft. Process cases of fraud and identity theft to Enforcement and other law enforcement agencies and investigate for further information. As cases are prosecuted, appear in court to testify on behalf of the DMV and correctly and effectively answer questions in reference to NCGS Chapter 20 and DMV policy and procedure. Have access to confidential imaging process and retrieve images for purposes of fraud and identity theft. Constant training and keeping up to current information on use of the court system and other records available. Accountability for accuracy and completion of work in a timely period. Make sure customers understand outcome on taking care of citations, suspensions and out of state problems so they can effectively take care of these issues. Extra skills and knowledge in pulling up, using and reading court system records to determine eligibility for license. Conduct interviews to determine eligibility for license and id for customers. Making complex decisions to assist customers in proper decisions on reinstatements, testing, and corrective or preventative actions. In situations where fraud is being committed, contact law enforcement, if needed, to take appropriate action. Provide relevant documentation and exhibits for court proceedings if warranted. Handle daily money collections and balance sheets. Make sure all monies are accounted for and that all transactions recorded are accurate. Make fee adjustments where applicable for purposes of correct issuances and auditing. Collect monies, balance sheets, bank deposits and disperse funds for daily use of eight examiners @ the West Charlotte Office. Conduct medical re-exams including road testing and all medical information for eligibility and summarize doctor reports and vision statements. Work with local, state, and federal law enforcement agencies as well as courts and out of state agencies and DMV offices, state’s attorneys, courthouses, judges, Social Security Administration, and many other government and private companies to provide effective customer assistance and insure compliance with NCGS Chapter 20 and all other laws and state policy. Possess a working knowledge of NCGS Chapters 14 and 15. Be able to determine that vehicles used for road test meet and qualify for NCGS Chapter 20 requirements before testing is permitted, including commercial vehicles and motorcycles. Communicate with a diverse range of customers and individuals to provide them with accurate service, including the hearing impaired, physically impaired, those from other cultures with different languages than our own, and all types of personalities, to ensure customer service while maintaining the integrity of our Division. Provide expert listening and question abilities to gather information to assist the customer. Operate and move equipment in the DMV to provide better and more adequate service. Previous employment in the Maryland State Police consisted of Automotive Safety Inspector. Primary duties were supervising 120 inspection stations and 400+ inspectors. Testing and conducting these programs @ a facility where 30 to 50 individuals were given written testing @ one time. Four to five hour hands on testing were performed for each individual who wanted to enter into the program. CDL testing was also given for Class A B and C with multiple endorsements.",
            "notes": "Also supervised the Hickory DMV Office."
        },
        {
            "title": "Driver License Examiner",
            "organization": "State of NC - DOT-DMV, Newton Office",
            "startDate": "May 2010",
            "endDate": "Promoted [Jul 2011]",
            "info": {
                "address": "1033 Smyre Farm Rd, Newton, NC 28658",
                "supervisor": "Cathy Rudisill [Senior Examiner] - Wiley 'Danny' Thomas [District Manager]",
                "supervisorNumber": "8284665518",
                "numberSupervised": 0,
                "reasonForLeaving": "Promoted to Senior Examiner"
            },
            "responsibilities": "Extensive training in different computer programs such as: CDLIS; SADLS; Court documents system; motor vehicle system. Fraudulent document training and recognition; Knowledge of Motor Vehicle Laws; FMCSR for commercial vehicles and drivers; recognition of medical issues and administering testing for clarification. Daily contact with diverse people with various issues dealing with fraud, identity problems, dwi, court issues, dmv investigations, certification of persons for driving privileges, actual testing in all types of motor vehicles."
        },
        {
            "title": "Driver License Examiner",
            "organization": "State of NC - DOT-DMV, Charlotte West Office",
            "startDate": "Nov 2008",
            "endDate": "May 2010",
            "info": {
                "address": "6016 Brookshire Bouldvard, Charlotte, NC 28216",
                "supervisor": "Gloria Tex Kidd",
                "supervisorNumber": "7043923266",
                "numberSupervised": 0,
                "startSalary": "$35,041",
                "endSalary": "$35,041"
            },
            "responsibilities": "Driver license examiner in Charlotte West office which is a cdl and mc site. Diversified ethnic group of customers with a high percentage of immigration issues. High volume customer base. Work is independent since we do not currently have a ds or a senior examiner. Daily contact with immigration, medical and many other issues. Handles the front desk and also the camera to issue tdc and id cards."
        },
        {
            "title": "Worked with Pete Painting",
            "startDate": "2007",
            "endDate": "2008"
        },
        {
            "title": "Automotive Vehicle Safety Inspector II",
            "organization": "State of Maryland, Maryland State Police",
            "startDate": "Jan 2002",
            "endDate": "Oct 2008",
            "info": {
                "address": "1201 Reisterstown Road, Pikesville, MD 21208-3899",
                "supervisor": "Sgt. William Lasner and Capt. Jeff Gahler",
                "supervisorNumber": "4107687388",
                "numberSupervised": "71 inspection stations",
                "startSalary": "$28,271",
                "endSalary": "$37,841",
                "reasonForLeaving": "Relocated to NC"
            },
            "technologies": [
                "management",
                "supervisory",
                "inspections"
            ],
            "responsibilities": "Supervise stations and Md. State Inspectors for compliance in certification and procedures in the safety inspection program. Conduct testing for applicants into the program. Cite and prosecute offenders. Maintain and operate a state car, computer, cell etc. Trained in ASE program; serve as DO @ the MVA in MD. Handle diverse problems; resolve situation with a wide diversity of ethnic backgrounds. Maintain docs for court hearings. Travel was a daily part of this position. Managed 71 inspection stations.",
            "notes": "Favorite Job"
        },
        {
            "title": "Commercial Vehicle Inspector",
            "organization": "Maryland State Police",
            "startDate": "Nov 2001",
            "endDate": "Promoted [Jan 2002]",
            "info": {
                "address": "1201 Reisterstown Road, Pikesville, MD 21208-3899",
                "supervisor": "Sgt. Mike White",
                "supervisorNumber": "4106946100",
                "numberSupervised": "4 per shift",
                "startSalary": "$26,512",
                "endSalary": "$28,271",
                "reasonForLeaving": "Promoted to another division."
            },
            "technologies": [
                "inspections",
                "haz mat",
                "crash investigations"
            ],
            "responsibilities": "Primary assignment was at the scale facility in Upper Marlboro, MD. Working in teams, we also conducted stationery patrols and road side weighs. I was also assigned to the post crash team and was on call for fatality and PI accidents involving commercial vehicles. Proficient in preparing docs for court proceedings. Certified in weights & measurements, level I-V inspections, Haz mat; Bulk and Tankers and Post Crash Investigations. Certificates in Accident Causation Investigation; Post Crash Investigation with Accident Reconstruction ( Commercial Vehicles and other classes of motor vehicles). Weights and Measurements; Level I through V motor vehicle inspections; Citation and report preparation; Certificate of Completion for Automotive Safety Inspections (six month training through Catonsville Comm. College (ASE). 10/2001 through 05/2006 Salvage Vehicle Certification Training."
        },
        {
            "title": "Unemployed",
            "startDate": "Fall 2000",
            "endDate": "Nov 2001"
        },
        {
            "title": "Workers Comp",
            "startDate": "Fall 1999",
            "endDate": "Fall 2000",
            "info": {
                "avgWage": "$900/week"
            }
        },
        {
            "title": "Worked at Vital Signs",
            "startDate": "2000",
            "endDate": "2005"
        },
        {
            "title": "Truck Driver",
            "organization": "Pepsi",
            "startDate": "Summer 1996",
            "endDate": "Fall 1999",
            "info": {
                "avgWage": "$900/week",
                "reasonForLeaving": "Got wiped out."
            },
            "notes": "best paying job"
        },
        {
            "title": "Production Line",
            "organization": "Pepsi",
            "startDate": "Late 1995",
            "endDate": "Summer 1996",
            "info": {
                "avgWage": "$500/week",
                "reasonForLeaving": "Manager offered a job driving tracter trailers. Said they were the best paid in the industry."
            },
            "notes": "Dream come true. Drink all the pepsi you want."
        },
        {
            "title": "Truck Driver",
            "organization": "Jones Motors",
            "startDate": "Early 1993",
            "endDate": "Late 1995",
            "info": {
                "address": "Spring City, PA",
                "avgWage": "$500/week",
                "reasonForLeaving": "Wanted a local job. Didn't want to drive all over the country. Pepsi had an opening on the line."
            },
            "notes": "Drove the truck down her driveway and bent the smoke stacks by hitting a tree branch."
        },
        {
            "title": "Truck Driver",
            "organization": "Falcon",
            "startDate": "Spring 1992",
            "endDate": "Early 1993",
            "info": {
                "avgWage": "$300/week",
                "reasonForLeaving": "Better job with Jones Motors. Jones Motors only hauled for General Motors which was unionized and had better pay and brand new equipment."
            },
            "notes": "Only with them for maybe 8 months."
        },
        {
            "title": "New Wedding",
            "startDate": "May 1989",
            "endDate": "Spring 1992"
        },
        {
            "title": "Patrolman",
            "organization": "Baltimore County Police Department",
            "startDate": "Dec 1982",
            "endDate": "May 1989",
            "info": {
                "supervisor": "Capt. James Scannell",
                "supervisorNumber": "4108877320",
                "numberSupervised": 0
            },
            "technologies": [
                "court procedures"
            ],
            "responsibilities": "Inclusive of report preparation, investigation techniques, crime scenes, psychology, citation preparation, speech writing for group presentation and extensive physical training. 01/1983 through 06/1982. Formal training in preparing documents for prosecution of criminal activity; Obtaining subpoena for court proceedings; extensive investigation experience; mediation through channels for resolution of issues. Also preparation of documentation for motor vehicle accidents involving fatalities for court. Experience working with diverse ethnic backgrounds. Daily travel for work requirements. Maintenance of state equipment (vehicle, computer, printer, camera, tools, etc.)"
        },
        {
            "title": "Full Time Mother",
            "startDate": "Jun 1978",
            "endDate": "Dec 1982"
        },
        {
            "title": "School Bus Driver",
            "organization": "Baltimore County Schools",
            "startDate": "Sept 1973",
            "endDate": "Jun 1978",
            "info": {
                "avgWage": "$200/week",
                "reasonForLeaving": "Was pregnant with Pete."
            },
            "notes": "Got your Class B CDL License. Got a 5 year pin for safe driving."
        },
        {
            "title": "Selling Produce",
            "organization": "Self-employed",
            "startDate": "Summer 1973",
            "endDate": "Fall 1981",
            "info": {
                "avgWage": "50% return",
                "reasonForLeaving": "Farm sold the land for development."
            },
            "notes": "Sold Corn, Strawberries, Tomotoes, Cantalope, Watermelon, Peaches, and Green Beans Out Of A Truck. Actually raised tomatoes in the fields. Edith would help sell in the evenings and on the weekends. Was only during the summer."
        },
        {
            "title": "Realtor",
            "organization": "Kay House Realty",
            "startDate": "Fall 1971",
            "endDate": "Winter 1972",
            "info": {
                "avgWage": "Commission",
                "reasonForLeaving": "Wasn't lucrative."
            }
        },
        {
            "title": "Flipping Used Motorcycles/Cars/Boats",
            "organization": "Hobby",
            "startDate": "Summer 1971",
            "endDate": "Fall 1985",
            "notes": "Easily sold 60 honda qa50/z50 minibikes. Willie Gerst would buy junk cars you she would fix them up and sell them in grannies yard."
        },
        {
            "title": "Secretary",
            "organization": "Kay House Realty",
            "startDate": "Spring 1971",
            "endDate": "Fall 1971",
            "info": {
                "reasonForLeaving": "Got real estate license and became a realtor."
            },
            "notes": "Started as a part-time secretary for four months then got realtor license."
        },
        {
            "title": "Accountant",
            "organization": "Self-employed",
            "startDate": "Sept 1971",
            "endDate": "Apr 1983",
            "info": {
                "avgPay": "$500/quarter",
                "reasonForLeaving": "Joined the police department."
            },
            "notes": "Went to school in Essex for Accounting. Was part-time on the side on her own. For 3 companies. Stopped when she joined the police department."
        },
        {
            "title": "Secretarial Pool",
            "organization": "Social Security Administration",
            "startDate": "Jun 1967",
            "endDate": "Aug 1969",
            "info": {
                "numCoworkers": 5,
                "startWage": "$55/week",
                "endWage": "$80/week",
                "reasonForLeaving": "Was pregnant with Michael."
            },
            "notes": "Elizabeth 'Lizzy' Gerst, Lawrence 'Larry' Beares, and Pauline Gerst also worked here. Larry Beares brother Bobby Beares also worked at George Register Flowers. Started out as level 1 and worked her way up to level 4."
        },
        {
            "title": "Administrative",
            "organization": "George Register Flowers",
            "startDate": "Feb 1966",
            "endDate": "Jun 1967",
            "info": {
                "startWage": "$1/hr",
                "endWage": "$1.25/hr",
                "reasonForLeaving": "Graduated High School"
            },
            "notes": "Anna Mae and her now husband John also worked here (just family friends not kin -- helped her get the job -- anna mae's dad ralph knew her dad). She met William Gerst while she was working here. He helped pull her truck off the railroad ties. Worked here on Saturday and after school until 9pm. Took orders, answered the phone, waited on customers that enetered the store. Used a typewriter for billing orders."
        },
        {
            "title": "Coding Clerk",
            "organization": "R.H. Donnelley's (White/Yellow Pages)",
            "startDate": "May 1964",
            "endDate": "Aug 1964",
            "info": {
                "avgPay": "$70/week",
                "reasonForLeaving": "Only Summer job. Needed to go back to school."
            },
            "notes": "Summer job. Wore Shirley's clothes to work. Drove with Shirley in their father's Blue 1961 Ford Fairlane. This is the only job Shirley ever had. Verified info (name, address, telephone) and typed that info into the typewriter."
        }
    ],
    "education": [
        {
            "degree": "CDL Recertification",
            "university": "NC Justice Academy",
            "startYear": "Nov 2010",
            "endYear": "Dec 2010",
            "achievements": "Three weeks of training through the NC Justice Academy to get recertified for CDL Certification."
        },
        {
            "degree": "CDL Certification",
            "university": "NC Justice Academy",
            "startYear": "Dec 2009",
            "endYear": "Dec 2009",
            "achievements": "Two weeks of training through the NC Justice Academy to get certified for CDL Certification."
        },
        {
            "degree": "Certificate - Driver License Examiner",
            "university": "NC Justice Academy",
            "startYear": "Mar 2009",
            "endYear": "Apr 2009",
            "achievements": "Nine weeks of training through the NC Justice Academy to get Drivers License Certification."
        },
        {
            "degree": "Certificate - Business Administration",
            "university": "Howard Community College",
            "startYear": 1995,
            "endYear": 1997,
            "technologies": [
                "business admin",
                "business law"
            ],
            "achievements": "Certificate course in Microsoft Word, Excel and Powerpoint."
        },
        {
            "degree": "Class A CDL Training",
            "university": "NETTTS - New England Tractor Trailer Training School",
            "startYear": 1991,
            "endYear": 1991,
            "achievements": "Class A CDL with all endorsements."
        },
        {
            "degree": "Police Officer, Diploma - Criminal Justice (CJ)",
            "university": "Baltimore County Police Academy",
            "startYear": 1982,
            "endYear": 1983,
            "achievements": "post crash, accident causation, emissions, Federal and Comar Regulations; Commercial Vehicle Inspector, Vehicle Safety Inspector, Salvage Inspection. Instructor for trainees; Driver License Examiner. Course in Management Training and Supervision through the MD State Police. Commercial Motor Vehicle Weight Enforcement Officer; Commercial Motor Vehicle Inspector; Hazmat Certification; Law Enforcement driver training; Noise and Abatement training; Emissions systems training; Salvage Vehicle Inspector; Automotive Vehicle Safety Inspector; Certified through CJIS and Maryland Motor Vehicle Records Systems through the Maryland State Police. Auto theft training. Accident causation and post crash certification. Proficient in training potential inspectors for certification in demonstrative, rules, regulations, etc. Interview Board.",
            "notes": "Endorsed through Catonsville Community College"
        },
        {
            "degree": "Real Estate License",
            "university": "Greater Baltimore Board of Realtors",
            "startYear": 1971,
            "endYear": 1971
        },
        {
            "degree": "Law and Accounting",
            "university": "Essex Community College",
            "startYear": 1971,
            "endYear": 1977,
            "technologies": [
                "microsoft word",
                "microsoft excel",
                "microsoft powerpoint"
            ],
            "achievements": "Microsoft Office Certificate. Tax & Cost Accounting."
        },
        {
            "degree": "Commercial Diploma",
            "university": "Kenwood Sr. High School",
            "startYear": 1964,
            "endYear": 1967,
            "clubs": [
                "drama",
                "newspaper"
            ]
        },
        {
            "university": "Middle River Jr. High School - 9th Grade",
            "startYear": 1963,
            "endYear": 1964,
            "notes": "Didn't want to go to Mount Carmel Catholic High School.",
            "sports": [
                "hockey"
            ]
        },
        {
            "university": "Queen Of Peace School - 3rd Grade - 8th Grade",
            "startYear": 1957,
            "endYear": 1963,
            "years": {
                "8": "62-63",
                "7": "61-62",
                "6": "60-61",
                "5": "59-60",
                "4": "58-59",
                "3": "57-58"
            }
        },
        {
            "university": "Mount Carmel School - 2nd Grade",
            "startYear": 1956,
            "endYear": 1957,
            "info": {
                "Second Grade Communion": "May 12, 1957"
            }
        },
        {
            "university": "Chase Elementary School - 1st Grade",
            "startYear": 1955,
            "endYear": 1956,
            "notes": "Had an overflow of 1st graders so they shipped you to Cowenton Church & School on Redlion Rd."
        }
    ]
}
